"""
[문항1] HTML과 자바스크립트, CSS에서 사용하는 주석은 어떻게 표기하는지 적으시오.
1) HTML :
2) 자바스크립트 :
3) CSS : (배점:5)
"""
# 1) <!-- HTML -->
# 2) // 자바스크립트
# 3) /* CSS */



"""
[문항2] 2. 아래 설명을 보고 밑줄에 가장 적당한 용어를 적으시오.
1)__________란 인터넷 서비스를 제공하는 프로그램이나 컴퓨터를 의미한다.
웹 시스템에서는 컴퓨터나 스마트 폰 등 다양한 기기를 사용하여 방문하는 웹 사이트의 정보를 담고 있는 프로그램이나 컴퓨터를 말한다. 이는 사용자가 요청하는 웹 페이지나 프로그램을 실행하여 해당 파일이나 그 결과를 사용자에게 제공하는 역할을 한다.
즉, 웹을 통해 사용자의 요청에 대한 결과를 반환해 준다.

2)_____________란 서버가 제공하는 인터넷 서비스를 이용하는 사용자나 사용자가 사용하는 기기를 의미한다. (배점:5)
"""
# 1) 서버
# 2) 클라이언트


"""
[문항3] 아래의 설명에 해당하는 응용 프로그램(tool)의 이름을 적고, 대표적인 프로그램 2개를 적으시오.

설명 :
이것은 웹 서버에서 웹 페이지를 가져오거나 웹 서버로 정보를 보낼 때 사용하는 프로그램으로, 사용자가 웹 페이지를 요청하면 웹 서버에 저장되어 있는 웹 페이지 정보를 불러와서 파싱(해석) 한 후 사용자의 화면에 출력해 준다.
(배점:5)
"""
# 웹 브라우저
# 1. 네이버
# 2. 다음

"""
[문항4] 숫자를 하나 입력받아 짝수인지 홀수인지 판단하는 자바스크립트 함수 func()를 작성하시오.
삼항연산자(? :)를 사용하여 숫자가 짝수인지 홀수인지 판별합니다.

조건 : 숫자가 짝수이면 "짝", 홀수이면 "홀"를 반환한다.
함수 호출 예 : console.log(func(4)); // 짝수 (배점:5)
"""
