## 연산자

# 치환 연산자

#################################################################################################
#################################################################################################
v1 = 3
v1 = v2 = v3 = 5
print(v1, v2, v3)
print('출력1', end = ' ')
print('출력2')
print('출력3')

v1, v2 = 10, 20
print(v1, v2)
v2, v1 = v1, v2     # 주소 참조형이기 때문에 가능한 데이터 치환
print(v1, v2)

print('값 할당 : packing 연산')
v1 = 1,2,3,4,5      # v1 = (1,2,3,4,5)
print(v1)
v1 = [1,2,3,4,5]    # v1 = (1,2,3,4,5)
print(v1)

#################################################################################################
#################################################################################################

*v1, v2 = [1,2,3,4,5]       # * packing은 첫 변수에만 선언 가능
print(v1, ' ', v2)      
# v1, v2* = [1,2,3,4,5]     # * packing은 첫 변수에만 선언 가능 -> 불가능
print(v1, ' ', v2)
*v1, v2, v3 = [1,2,3,4,5]       # * packing은 첫 변수에만 선언 가능
print(v1, ' ', v2, ' ', v3)

#################################################################################################
#################################################################################################

print()
print('카페 python 예제')
print(format(1.5678, '10.3f'))
print('나는 나이가 %d 이다.'%23)                            # %d : 숫자열
print('나는 나이가 %s 이다.'%'스물셋')                      # %d : 문자열
print('나는 나이가 %d 이고 이름은 %s이다.'%(23, '홍길동'))  # %d : 숫자열
print('나는 나이가 %s 이고 이름은 %s이다.'%(23, '홍길동'))
print('나는 키가 %f이고, 에너지가 %d%%.'%(177.7, 100))
print('이름은 {0}, 나이는 {1}'.format('한국인', 33))
print('이름은 {}, 나이는 {}'.format('신선해', 33))
print('이름은 {1}, 나이는 {0}'.format(34, '강나루'))

abc = 123
print(f"abc의 값은 {abc}입니다")

# \n : 다음 라인으로 건너뜀
# \t : tab 키 간격만큼 건너뜀
print('\n본격적 연산 ------------')     
print(5 + 3, 5 - 3, 5 * 3, 5 / 3, 5 // 3, 5 % 3, 3 ** 3)
print(divmod(5,3), 5 % 3)

#################################################################################################
#################################################################################################

# 연산자 계산 순서
# () -> ** -> 단항 -> 산술(*, /, //, % -> +, -) -> 관계 -> 논리(not -> and -> or) -> =
reslut = 3 + 4 * 5 + (2 + 3) / 2
print(reslut)

print(5 > 3, 5 == 3, 5 !=3)

print(5 > 3 and 4 < 3, 5 > 3 or 4 < 3, not(5 >= 3))

# and 연산 순위가 or 보다 높음 -> and 먼저 계산
print(True or False and False)
print(True and False or False)
print('&&&&&&'*10)
#################################################################################################
#################################################################################################

# 산술 연산
print(4 + 5)

# 문자열 더하기 연산
print('4' + "5")
print("한국"*5)         # 한국한국한국한국한국

# ++, -- 와 같은 증감 연산자 X
print('누적')
a = 10
a = a + 1
a += 1          # -=, *=, /= 
print(f"a는 {a}")

print(--a)      # -1 * -1 = +1
print(-a)       # 부호 변경
print(a * -1)   # 부호 변경

print('1' + '1')
# print(('1' + '1') + 1)                   # '문자 11' + 숫자 1 : type error
print((int('1') + int('1')) + 1)             # int('1') -> 문자 '1'을 정수형 숫자 1 로 바꿔줌
print((float('1') + int('1')) + 1)            # float('1') -> 문자 '1'을 실수형 숫자 1.0 으로 바꿔줌
print(str(1 + 1) + '1')                     # 1+1 숫자를 str함수로 '2'로 문자열로 변환
print('boolean 처리 : ', bool(True), bool(False))   # bool(True) = True, bool(False) = False

# bool : python에서 데이터가 있으면 True, 없으면 False
print(bool(1), bool(12.3), bool('ok'), bool([12]))
print(bool(0), bool(0.0), bool(''), bool([]), bool(None))

# r 선행문자 : escape 문자(\n, \t) 무시
print('aa\tbb')
print('aa\nbb')
print(r'aa\bb')
print(r'aa\nbb')
