# 터미널창 초기화
import os
os.system('cls')

# 통계량  : 데이터의 특징을 하나의 숫자로 요약한 것.
# 표본 데이터를 추출해 전체(모집단) 데이터를 짐작 가능
# 평균, 분산, 표준편차, ...

grades = [1, 3, -2, 4]


# ####################################################################################################################################
#                                               python 기본 함수 사용
# ####################################################################################################################################
print("####################################################################################################################################")
print("                                              python 기본 함수 사용")
print("####################################################################################################################################")

def show_grades(grades):
    print(grades, end = " ")


def grades_sum(grades):
    tot = 0
    for g in grades:
        tot += g
    return tot
print("합은", grades_sum(grades))


def grades_ave(grades):
    ave = grades_sum(grades) / len(grades)
    return ave
print("평군은", grades_ave(grades))


# 분산(variance) : 편차 제곱의 평균 -->> 평균값을 기준으로 다른 값 들의 흩어진 정도
def grades_variance(grades):
    ave = grades_ave(grades)
    vari = 0
    for su in grades:
        vari += (su-ave)**2
    return vari / len(grades)
print("분산은", grades_variance(grades))

# 표준편차(std)
def grades_std(grades):
    return grades_variance(grades)
print("표준편차는", grades_ave(grades))


# ####################################################################################################################################
#                                               numpy 지원 함수 사용
# ####################################################################################################################################
print("####################################################################################################################################")
print("                                              numpy 지원 함수 사용")
print("####################################################################################################################################")

import numpy
print('합 : ', numpy.sum(grades))
print('평균 : ', numpy.mean(grades))
print('분산 : ', numpy.var(grades))
print('표준편차 : ', numpy.std(grades))