# 터미널창 초기화
import os
os.system('cls')

# 알고리즘은 특정 문제를 해결하기 위한 명확하고 단계적인 절차나 규칙의 집합
# 입력값을 받아 유한한 시간 내에 정해진 논리적 순서에 따라 문제를 해결하고
# 결과물을 도출하는 과정으로, 컴퓨터 프로그래밍 및 일상생활의 문제 해결

print("""
# ######################################################################################################################
#                                   1부터 n까지 연속한 숫자의 합을 구하는 알고리즘
# ######################################################################################################################
""")


print("\n\n---------------------- 일반적인 for 반복문 ----------------------") 
def sum_n(n):
    s = 0
    for i in range(1, n+1):
        s = s + i
    return s

print(sum_n(10))

print("\n\n---------------------- 가우스 덧셈 공식 ----------------------")
def sum_n2(n):
    return n * (n+1) // 2

print(sum_n2(10))

print("""
# ######################################################################################################################
#                                                   최대값 구하기
# ######################################################################################################################
    """)
d = [17, 92, 33, 58, 7, 32, 42]

print("\n\n---------------------- python max() 함수 ----------------------") 
print(max(d))

print("\n\n---------------------- 최대값 구하는 알고리즘 ----------------------") 
def find_max(a):
    n = len(a)
    max_v = a[0]
    for i in range(1, n):                   # 이미 max_v에 0번째 index값은 들어가 있으므로, 1번째~n-1번째 index까지 for 반복
        if a[i] > max_v:
            max_v = a[i]
    return max_v

print(find_max(d))


print("""
# ######################################################################################################################
#                                                  최대공약수 구하기
# ######################################################################################################################
    """)

print("\n\n---------------------- 일반적인 for 반복문 ----------------------") 
# 예) 4, 6 : 4와 6은 2로 나누어 떨어지므로, 2(GCD)
def gcd(a, b):
    i = min(a, b)
    while True:                 # False로 바뀌기 전까지 계속 반복
        if a % i == 0 and b % i == 0:
            return i
        i = i - 1
# print(gcd(4, 6))
# print(gcd(24, 16))
print(gcd(81, 27))


print("\n\n---------------------- 유클리드 방식 ----------------------")
def gcdFunc2(a, b):
    if b == 0:
        return a
    return gcdFunc2(b, a % b)       # 좀 더 작은값으로 재귀 호출

print(gcdFunc2(4, 6))
print(gcdFunc2(24, 16))