# 터미널창 초기화
import os
os.system('cls')


print("""
# ######################################################################################################################
#                                   리스트 안에 들어있는 자료를 오름차순 정렬
# ######################################################################################################################
""")

print("========================================== 5) Bubble 정렬 ==========================================")
print("이웃한 요소와 비교")
# [2, 4, 5, 1, 3]
# [2, 4, 5, 1, 3]
# [2, 4, 1, 5, 3]
# [2, 4, 1, 3, 5]
# ...

def bubble_sort(a):
    n = len(a)
    while True:
        changed = False                     # 자료를 앞 뒤로 변경 여부
    
        for i in range(0, n-1):
            if a[i] > a[i+1]:                   # 앞이 뒤보다 크면
                a[i], a[i+1] = a[i+1], a[i]
                changed = True
        if changed == False:
            break
    return a

d = [2, 4, 5, 1, 3]
print(bubble_sort(d))


